{
  "class_name": "Sequential",
  "config": [
    {
      "class_name": "InputLayer",
      "config": {
        "batch_input_shape": [
          null,
          224,
          224,
          3
        ],
        "dtype": "float32",
        "sparse": false,
        "name": "input_1"
      }
    },
    {
      "class_name": "Conv2D",
      "config": {
        "name": "block1_conv1",
        "trainable": true,
        "filters": 64,
        "kernel_size": [
          3,
          3
        ],
        "strides": [
          1,
          1
        ],
        "padding": "same",
        "data_format": "channels_last",
        "dilation_rate": [
          1,
          1
        ],
        "activation": "relu",
        "use_bias": true,
        "kernel_initializer": {
          "class_name": "VarianceScaling",
          "config": {
            "scale": 1,
            "mode": "fan_avg",
            "distribution": "uniform",
            "seed": null
          }
        },
        "bias_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "kernel_regularizer": null,
        "bias_regularizer": null,
        "activity_regularizer": null,
        "kernel_constraint": null,
        "bias_constraint": null
      }
    },
    {
      "class_name": "Conv2D",
      "config": {
        "name": "block1_conv2",
        "trainable": true,
        "filters": 64,
        "kernel_size": [
          3,
          3
        ],
        "strides": [
          1,
          1
        ],
        "padding": "same",
        "data_format": "channels_last",
        "dilation_rate": [
          1,
          1
        ],
        "activation": "relu",
        "use_bias": true,
        "kernel_initializer": {
          "class_name": "VarianceScaling",
          "config": {
            "scale": 1,
            "mode": "fan_avg",
            "distribution": "uniform",
            "seed": null
          }
        },
        "bias_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "kernel_regularizer": null,
        "bias_regularizer": null,
        "activity_regularizer": null,
        "kernel_constraint": null,
        "bias_constraint": null
      }
    },
    {
      "class_name": "MaxPooling2D",
      "config": {
        "name": "block1_pool",
        "trainable": true,
        "pool_size": [
          2,
          2
        ],
        "padding": "valid",
        "strides": [
          2,
          2
        ],
        "data_format": "channels_last"
      }
    },
    {
      "class_name": "Conv2D",
      "config": {
        "name": "block2_conv1",
        "trainable": true,
        "filters": 128,
        "kernel_size": [
          3,
          3
        ],
        "strides": [
          1,
          1
        ],
        "padding": "same",
        "data_format": "channels_last",
        "dilation_rate": [
          1,
          1
        ],
        "activation": "relu",
        "use_bias": true,
        "kernel_initializer": {
          "class_name": "VarianceScaling",
          "config": {
            "scale": 1,
            "mode": "fan_avg",
            "distribution": "uniform",
            "seed": null
          }
        },
        "bias_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "kernel_regularizer": null,
        "bias_regularizer": null,
        "activity_regularizer": null,
        "kernel_constraint": null,
        "bias_constraint": null
      }
    },
    {
      "class_name": "Conv2D",
      "config": {
        "name": "block2_conv2",
        "trainable": true,
        "filters": 128,
        "kernel_size": [
          3,
          3
        ],
        "strides": [
          1,
          1
        ],
        "padding": "same",
        "data_format": "channels_last",
        "dilation_rate": [
          1,
          1
        ],
        "activation": "relu",
        "use_bias": true,
        "kernel_initializer": {
          "class_name": "VarianceScaling",
          "config": {
            "scale": 1,
            "mode": "fan_avg",
            "distribution": "uniform",
            "seed": null
          }
        },
        "bias_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "kernel_regularizer": null,
        "bias_regularizer": null,
        "activity_regularizer": null,
        "kernel_constraint": null,
        "bias_constraint": null
      }
    },
    {
      "class_name": "MaxPooling2D",
      "config": {
        "name": "block2_pool",
        "trainable": true,
        "pool_size": [
          2,
          2
        ],
        "padding": "valid",
        "strides": [
          2,
          2
        ],
        "data_format": "channels_last"
      }
    },
    {
      "class_name": "Conv2D",
      "config": {
        "name": "block3_conv1",
        "trainable": true,
        "filters": 256,
        "kernel_size": [
          3,
          3
        ],
        "strides": [
          1,
          1
        ],
        "padding": "same",
        "data_format": "channels_last",
        "dilation_rate": [
          1,
          1
        ],
        "activation": "relu",
        "use_bias": true,
        "kernel_initializer": {
          "class_name": "VarianceScaling",
          "config": {
            "scale": 1,
            "mode": "fan_avg",
            "distribution": "uniform",
            "seed": null
          }
        },
        "bias_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "kernel_regularizer": null,
        "bias_regularizer": null,
        "activity_regularizer": null,
        "kernel_constraint": null,
        "bias_constraint": null
      }
    },
    {
      "class_name": "Conv2D",
      "config": {
        "name": "block3_conv2",
        "trainable": true,
        "filters": 256,
        "kernel_size": [
          3,
          3
        ],
        "strides": [
          1,
          1
        ],
        "padding": "same",
        "data_format": "channels_last",
        "dilation_rate": [
          1,
          1
        ],
        "activation": "relu",
        "use_bias": true,
        "kernel_initializer": {
          "class_name": "VarianceScaling",
          "config": {
            "scale": 1,
            "mode": "fan_avg",
            "distribution": "uniform",
            "seed": null
          }
        },
        "bias_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "kernel_regularizer": null,
        "bias_regularizer": null,
        "activity_regularizer": null,
        "kernel_constraint": null,
        "bias_constraint": null
      }
    },
    {
      "class_name": "Conv2D",
      "config": {
        "name": "block3_conv3",
        "trainable": true,
        "filters": 256,
        "kernel_size": [
          3,
          3
        ],
        "strides": [
          1,
          1
        ],
        "padding": "same",
        "data_format": "channels_last",
        "dilation_rate": [
          1,
          1
        ],
        "activation": "relu",
        "use_bias": true,
        "kernel_initializer": {
          "class_name": "VarianceScaling",
          "config": {
            "scale": 1,
            "mode": "fan_avg",
            "distribution": "uniform",
            "seed": null
          }
        },
        "bias_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "kernel_regularizer": null,
        "bias_regularizer": null,
        "activity_regularizer": null,
        "kernel_constraint": null,
        "bias_constraint": null
      }
    },
    {
      "class_name": "MaxPooling2D",
      "config": {
        "name": "block3_pool",
        "trainable": true,
        "pool_size": [
          2,
          2
        ],
        "padding": "valid",
        "strides": [
          2,
          2
        ],
        "data_format": "channels_last"
      }
    },
    {
      "class_name": "Conv2D",
      "config": {
        "name": "block4_conv1",
        "trainable": true,
        "filters": 512,
        "kernel_size": [
          3,
          3
        ],
        "strides": [
          1,
          1
        ],
        "padding": "same",
        "data_format": "channels_last",
        "dilation_rate": [
          1,
          1
        ],
        "activation": "relu",
        "use_bias": true,
        "kernel_initializer": {
          "class_name": "VarianceScaling",
          "config": {
            "scale": 1,
            "mode": "fan_avg",
            "distribution": "uniform",
            "seed": null
          }
        },
        "bias_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "kernel_regularizer": null,
        "bias_regularizer": null,
        "activity_regularizer": null,
        "kernel_constraint": null,
        "bias_constraint": null
      }
    },
    {
      "class_name": "Conv2D",
      "config": {
        "name": "block4_conv2",
        "trainable": true,
        "filters": 512,
        "kernel_size": [
          3,
          3
        ],
        "strides": [
          1,
          1
        ],
        "padding": "same",
        "data_format": "channels_last",
        "dilation_rate": [
          1,
          1
        ],
        "activation": "relu",
        "use_bias": true,
        "kernel_initializer": {
          "class_name": "VarianceScaling",
          "config": {
            "scale": 1,
            "mode": "fan_avg",
            "distribution": "uniform",
            "seed": null
          }
        },
        "bias_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "kernel_regularizer": null,
        "bias_regularizer": null,
        "activity_regularizer": null,
        "kernel_constraint": null,
        "bias_constraint": null
      }
    },
    {
      "class_name": "Conv2D",
      "config": {
        "name": "block4_conv3",
        "trainable": true,
        "filters": 512,
        "kernel_size": [
          3,
          3
        ],
        "strides": [
          1,
          1
        ],
        "padding": "same",
        "data_format": "channels_last",
        "dilation_rate": [
          1,
          1
        ],
        "activation": "relu",
        "use_bias": true,
        "kernel_initializer": {
          "class_name": "VarianceScaling",
          "config": {
            "scale": 1,
            "mode": "fan_avg",
            "distribution": "uniform",
            "seed": null
          }
        },
        "bias_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "kernel_regularizer": null,
        "bias_regularizer": null,
        "activity_regularizer": null,
        "kernel_constraint": null,
        "bias_constraint": null
      }
    },
    {
      "class_name": "MaxPooling2D",
      "config": {
        "name": "block4_pool",
        "trainable": true,
        "pool_size": [
          2,
          2
        ],
        "padding": "valid",
        "strides": [
          2,
          2
        ],
        "data_format": "channels_last"
      }
    },
    {
      "class_name": "Conv2D",
      "config": {
        "name": "block5_conv1",
        "trainable": true,
        "filters": 512,
        "kernel_size": [
          3,
          3
        ],
        "strides": [
          1,
          1
        ],
        "padding": "same",
        "data_format": "channels_last",
        "dilation_rate": [
          1,
          1
        ],
        "activation": "relu",
        "use_bias": true,
        "kernel_initializer": {
          "class_name": "VarianceScaling",
          "config": {
            "scale": 1,
            "mode": "fan_avg",
            "distribution": "uniform",
            "seed": null
          }
        },
        "bias_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "kernel_regularizer": null,
        "bias_regularizer": null,
        "activity_regularizer": null,
        "kernel_constraint": null,
        "bias_constraint": null
      }
    },
    {
      "class_name": "Conv2D",
      "config": {
        "name": "block5_conv2",
        "trainable": true,
        "filters": 512,
        "kernel_size": [
          3,
          3
        ],
        "strides": [
          1,
          1
        ],
        "padding": "same",
        "data_format": "channels_last",
        "dilation_rate": [
          1,
          1
        ],
        "activation": "relu",
        "use_bias": true,
        "kernel_initializer": {
          "class_name": "VarianceScaling",
          "config": {
            "scale": 1,
            "mode": "fan_avg",
            "distribution": "uniform",
            "seed": null
          }
        },
        "bias_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "kernel_regularizer": null,
        "bias_regularizer": null,
        "activity_regularizer": null,
        "kernel_constraint": null,
        "bias_constraint": null
      }
    },
    {
      "class_name": "Conv2D",
      "config": {
        "name": "block5_conv3",
        "trainable": true,
        "filters": 512,
        "kernel_size": [
          3,
          3
        ],
        "strides": [
          1,
          1
        ],
        "padding": "same",
        "data_format": "channels_last",
        "dilation_rate": [
          1,
          1
        ],
        "activation": "relu",
        "use_bias": true,
        "kernel_initializer": {
          "class_name": "VarianceScaling",
          "config": {
            "scale": 1,
            "mode": "fan_avg",
            "distribution": "uniform",
            "seed": null
          }
        },
        "bias_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "kernel_regularizer": null,
        "bias_regularizer": null,
        "activity_regularizer": null,
        "kernel_constraint": null,
        "bias_constraint": null
      }
    },
    {
      "class_name": "MaxPooling2D",
      "config": {
        "name": "block5_pool",
        "trainable": true,
        "pool_size": [
          2,
          2
        ],
        "padding": "valid",
        "strides": [
          2,
          2
        ],
        "data_format": "channels_last"
      }
    },
    {
      "class_name": "Flatten",
      "config": {
        "name": "flatten",
        "trainable": true
      }
    },
    {
      "class_name": "Dropout",
      "config": {
        "name": "dropout_1",
        "trainable": true,
        "rate": 0.5
      }
    },
    {
      "class_name": "Dense",
      "config": {
        "name": "fc1",
        "trainable": true,
        "units": 1536,
        "activation": "linear",
        "use_bias": true,
        "kernel_initializer": {
          "class_name": "VarianceScaling",
          "config": {
            "scale": 1,
            "mode": "fan_in",
            "distribution": "uniform",
            "seed": null
          }
        },
        "bias_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "kernel_regularizer": null,
        "bias_regularizer": null,
        "activity_regularizer": null,
        "kernel_constraint": null,
        "bias_constraint": null
      }
    },
    {
      "class_name": "LeakyReLU",
      "config": {
        "name": "leaky_re_lu_1",
        "trainable": true,
        "alpha": 0.30000001192092896
      }
    },
    {
      "class_name": "Dropout",
      "config": {
        "name": "dropout_2",
        "trainable": true,
        "rate": 0.5
      }
    },
    {
      "class_name": "Dense",
      "config": {
        "name": "fc2",
        "trainable": true,
        "units": 1536,
        "activation": "linear",
        "use_bias": true,
        "kernel_initializer": {
          "class_name": "VarianceScaling",
          "config": {
            "scale": 1,
            "mode": "fan_in",
            "distribution": "uniform",
            "seed": null
          }
        },
        "bias_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "kernel_regularizer": null,
        "bias_regularizer": null,
        "activity_regularizer": null,
        "kernel_constraint": null,
        "bias_constraint": null
      }
    },
    {
      "class_name": "LeakyReLU",
      "config": {
        "name": "leaky_re_lu_2",
        "trainable": true,
        "alpha": 0.30000001192092896
      }
    },
    {
      "class_name": "Dropout",
      "config": {
        "name": "dropout_3",
        "trainable": true,
        "rate": 0.5
      }
    },
    {
      "class_name": "BatchNormalization",
      "config": {
        "name": "batch_normalization_1",
        "trainable": true,
        "axis": -1,
        "momentum": 0.99,
        "epsilon": 0.001,
        "center": true,
        "scale": true,
        "beta_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "gamma_initializer": {
          "class_name": "Ones",
          "config": {}
        },
        "moving_mean_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "moving_variance_initializer": {
          "class_name": "Ones",
          "config": {}
        },
        "beta_regularizer": null,
        "gamma_regularizer": null,
        "beta_constraint": null,
        "gamma_constraint": null
      }
    },
    {
      "class_name": "Dense",
      "config": {
        "name": "colorize",
        "trainable": true,
        "units": 2178,
        "activation": "linear",
        "use_bias": true,
        "kernel_initializer": {
          "class_name": "VarianceScaling",
          "config": {
            "scale": 1,
            "mode": "fan_in",
            "distribution": "uniform",
            "seed": null
          }
        },
        "bias_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "kernel_regularizer": null,
        "bias_regularizer": null,
        "activity_regularizer": null,
        "kernel_constraint": null,
        "bias_constraint": null
      }
    },
    {
      "class_name": "Activation",
      "config": {
        "name": "activation_1",
        "trainable": true,
        "activation": "tanh"
      }
    }
  ],
  "keras_version": "2.0.2",
  "backend": "tensorflow"
}